name: "VGG_ILSVRC_16_layer"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: true
  }
  data_param {
    source: "/home/zyan3/local/data/imagenet/ilsvrc12/ilsvrc12_train_size384_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: false
  }
  data_param {
    source: "/home/zyan3/local/data/imagenet/ilsvrc12/ilsvrc12_val_size384_lmdb"
    batch_size: 1
    backend: LMDB
  }
}

layer {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "Relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "Relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "shift_pool1"
  name: "shift_pool1"
  type: "ShiftPooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "shift_pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "Relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "Relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "shift_pool2"
  name: "shift_pool2"
  type: "ShiftPooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "shift_pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "Relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "Relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "Relu3_3"
  type: "ReLU"
}

layer {
  bottom: "conv3_3"
  top: "shift_pool3"
  name: "shift_pool3"
  type: "ShiftPooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "shift_pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "Relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "Relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "Relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "shift_pool4"
  name: "shift_pool4"
  type: "ShiftPooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "shift_pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "Relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "Relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "Relu5_3"
  type: "ReLU"
}
layer {
  bottom: "conv5_3"
  top: "shift_pool5"
  name: "shift_pool5"
  type: "ShiftPooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}


layer {
  bottom: "shift_pool5"
  top: "fc6"
  name: "fc6"
  type: "Convolution"
  convolution_param {
    num_output: 4096
    pad: 3
    kernel_size: 7
    init_from_inner_product: true    
  }
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "Relu6"
  type: "ReLU"
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc6"
  top: "fc7"
  name: "fc7"
  type: "Convolution"
  convolution_param {
    num_output: 4096
    pad: 0
    kernel_size: 1
    init_from_inner_product: true
  }
}
layer {
  bottom: "fc7"
  top: "fc7"
  name: "Relu7"
  type: "ReLU"
}

layer {
  bottom: "fc7"
  top: "fc7"
  name: "drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  bottom: "fc7"
  top: "stitch_fc7"
  name: "stitch_fc7"
  type: "ShiftStitch"
  shift_stitch_param {
    iter: 5
    stride: 2
    stride: 2
    stride: 2
    stride: 2
    stride: 2    
  }
}
layer {
  bottom: "fc7"
  top: "fc8"
  name: "fc8"
  type: "Convolution"
  convolution_param {
    num_output: 1000
    pad: 0
    kernel_size: 1
    init_from_inner_product: true    
  }
}

layer {
  bottom: "fc8"
  top: "stitch_fc8"
  name: "stitch_fc8"
  type: "ShiftStitch"
  shift_stitch_param {
    iter: 5
    stride: 2
    stride: 2
    stride: 2
    stride: 2
    stride: 2    
  }
}

layer {
  name: "spatial_accuracy_top1"
  type: "SpatialAccuracy"
  bottom: "stitch_fc8"
  bottom: "label"
  top: "spatial_accuracy_top1"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 1
  }  
}

layer {
  name: "spatial_accuracy_top5"
  type: "SpatialAccuracy"
  bottom: "stitch_fc8"
  bottom: "label"
  top: "spatial_accuracy_top5"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 5
  }  
}

#layer {
#  bottom: "shift_pool5"
#  top: "fc6"
#  name: "fc6"
#  type: "InnerProduct"
#  inner_product_param {
#    num_output: 4096
#  }
#}
#layer {
#  bottom: "fc6"
#  top: "fc6"
#  name: "Relu6"
#  type: "ReLU"
#}
#layer {
#  bottom: "fc6"
#  top: "fc6"
#  name: "drop6"
#  type: "Dropout"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#}
#layer {
#  bottom: "fc6"
#  top: "fc7"
#  name: "fc7"
#  type: "InnerProduct"
#  inner_product_param {
#    num_output: 4096
#  }
#}
#layer {
#  bottom: "fc7"
#  top: "fc7"
#  name: "Relu7"
#  type: "ReLU"
#}
#layer {
#  bottom: "fc7"
#  top: "fc7"
#  name: "drop7"
#  type: "Dropout"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#}
#layer {
#  bottom: "fc7"
#  top: "fc8"
#  name: "fc8"
#  type: "InnerProduct"
#  inner_product_param {
#    num_output: 1000
#  }
#}
#
#layer {
#  bottom: "fc8"
#  top: "prob"
#  name: "prob"
#  type: "Softmax"
#}
#





