name: "VGG_ILSVRC_16_layer"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: true
    resize_short_side_min: 256
    resize_short_side_max: 512    
  }
  data_param {
    source: "/home/zyan3/local/data/imagenet/ilsvrc12/ilsvrc12_train_encoded_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "DataVariableSize"
  top: "data"
  top: "data_size"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: false
  }
  data_variable_size_param {
    source: "/home/zyan3/proj/dl-image-enhance/data/uniform_set/uniform_set_long_2048_lmdb"
    batch_size: 1
    backend: LMDB
    max_pixel_num: 4194304
    selective_list: "examples/uniform_set/uniform_set_for_convert_imageset.txt"
    selective_list_shuffle: false
  }
}

layer {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}

layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "Relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "Relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  conserve_gpu_memory_test: true  
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  conserve_gpu_memory_test: true  
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "Relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  conserve_gpu_memory_test: true  
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "Relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  conserve_gpu_memory_test: true
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  conserve_gpu_memory_test: true  
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "Relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "Relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "Relu3_3"
  type: "ReLU"
}

layer {
  bottom: "conv3_3"
  top: "shift_pool3"
  name: "shift_pool3"
  type: "ShiftPooling"
  conserve_gpu_memory_test: true
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "shift_pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "Relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "Relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "Relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "shift_pool4"
  name: "shift_pool4"
  type: "ShiftPooling"
  conserve_gpu_memory_test: true
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "shift_pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "Relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "Relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "Relu5_3"
  type: "ReLU"
}
layer {
  bottom: "conv5_3"
  top: "shift_pool5"
  name: "shift_pool5"
  type: "ShiftPooling"
  conserve_gpu_memory_test: true
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}


layer {
  bottom: "shift_pool5"
  top: "fc6"
  name: "fc6"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 4096
    pad: 3
    kernel_size: 7
    init_from_inner_product: true
  }
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "Relu6"
  type: "ReLU"
}

layer {
  bottom: "fc6"
  top: "fc7"
  name: "fc7"
  type: "Convolution"
  conserve_gpu_memory_test: true
  convolution_param {
    num_output: 4096
    pad: 0
    kernel_size: 1
    init_from_inner_product: true
  }
}

layer {
  bottom: "fc7"
  top: "stitch_fc7"
  name: "stitch_fc7"
  type: "ShiftStitch"
  conserve_gpu_memory_test: true  
  shift_stitch_param {
    iter: 3
    stride: 2
    stride: 2
    stride: 2
  }
}

layer {
  name: "spatial_accuracy_top1"
  type: "SpatialAccuracy"
  bottom: "stitch_fc7"
  bottom: "label"
  bottom: "data_size"
  top: "accuracy_top1"
  include {
    phase: TEST
  }
  conserve_gpu_memory_test: false
  spatial_accuracy_param {
    top_k: 1
    spatial_subsample_height_factor: 8
    spatial_subsample_width_factor: 8
  }  
}
