name: "hdcnn_CIFAR100_NIN_float_crop_v2_deploy"
input: "data"
input_dim: 100
input_dim: 3
input_dim: 26
input_dim: 26



layer {
  bottom: "data"
  top: "conv1"
  name: "conv1"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
    bottom: "conv1"
    top: "cccp1"
    name: "cccp1"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 160
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
   }
}
layer {
  bottom: "cccp1"
  top: "cccp1"
  name: "relu1"
  type: "ReLU"
} 
layer {
    bottom: "cccp1"
    top: "cccp2"
    name: "cccp2"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 96
        kernel_size: 1
        stride: 1            
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
   }
}
layer {
  bottom: "cccp2"
  top: "cccp2"
  name: "relu2"
  type: "ReLU"
}
layer {
  bottom: "cccp2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  bottom: "pool1"
  top: "pool1"
  name: "drop1"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  bottom: "pool1"
  top: "conv2"
  name: "conv2"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 1200
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/conv2_64_1200_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/conv2_64_1200_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "conv2"
    top: "cccp3"
    name: "cccp3"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/cccp3_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/cccp3_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cccp3"
  top: "cccp3"
  name: "relu3"
  type: "ReLU"
}
layer {
    bottom: "cccp3"
    top: "cccp4"
    name: "cccp4"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/cccp4_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/cccp4_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cccp4"
  top: "cccp4"
  name: "relu4"
  type: "ReLU"
}


layer {
  bottom: "cccp4"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "pool2"
  name: "drop2"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  bottom: "pool2"
  top: "conv3"
  name: "conv3"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 576
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/conv3_64_576_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/conv3_64_576_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "conv3"
    top: "cccp5"
    name: "cccp5"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/cccp5_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/cccp5_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cccp5"
  top: "cccp5"
  name: "relu5"
  type: "ReLU"
}
layer {
    bottom: "cccp5"
    top: "cccp6"
    name: "cccp6"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 100
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }   
  }
}
layer {
  bottom: "cccp6"
  top: "cccp6"
  name: "relu6"
  type: "ReLU"
}

layer {
  bottom: "cccp6"
  top: "poolg"
  name: "poolg"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 6
    stride: 1
  }
}
layer {
	name: "fine_branch_prob"
	type: "Softmax"
	bottom: "poolg"
	top: "fine_branch_prob"
}
layer {
	name: "coarse_branch_prob"
	type: "Fine2MultiCoarseProb"
	bottom: "fine_branch_prob"
	top: "coarse_branch_prob"
	fine2multicoarse_prob_layer_param{
		num_coarse: 9
		fine2multicoarse_param{
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 5
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
			coarse_id: 7
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 3
			coarse_id: 5
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 6
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 5
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 4
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 5
		}
		fine2multicoarse_param{
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 7
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 7
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 7
		}
		fine2multicoarse_param{
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 5
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 7
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 6
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 4
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 7
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 8
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 6
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 5
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
			coarse_id: 7
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 5
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 3
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 4
			coarse_id: 7
		}
	}
}
layer {
  bottom: "pool1"
  top: "cluster00_conv2"
  name: "cluster00_conv2"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 1200
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster00_conv2_64_1200_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster00_conv2_64_1200_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster00_conv2"
    top: "cluster00_cccp3"
    name: "cluster00_cccp3"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster00_cccp3_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster00_cccp3_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster00_cccp3"
  top: "cluster00_cccp3"
  name: "cluster00_relu3"
  type: "ReLU"
}
layer {
    bottom: "cluster00_cccp3"
    top: "cluster00_cccp4"
    name: "cluster00_cccp4"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster00_cccp4_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster00_cccp4_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster00_cccp4"
  top: "cluster00_cccp4"
  name: "cluster00_relu4"
  type: "ReLU"
}


layer {
  bottom: "cluster00_cccp4"
  top: "cluster00_pool2"
  name: "cluster00_pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "cluster00_pool2"
  top: "cluster00_pool2"
  name: "cluster00_drop2"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  bottom: "cluster00_pool2"
  top: "cluster00_conv3"
  name: "cluster00_conv3"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 576
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster00_conv3_64_576_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster00_conv3_64_576_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster00_conv3"
    top: "cluster00_cccp5"
    name: "cluster00_cccp5"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster00_cccp5_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster00_cccp5_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster00_cccp5"
  top: "cluster00_cccp5"
  name: "cluster00_relu5"
  type: "ReLU"
}
layer {
    bottom: "cluster00_cccp5"
    top: "cluster00_cccp6_compact"
    name: "cluster00_cccp6_compact"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
		num_output: 25
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }   
  }
}
layer {
  bottom: "cluster00_cccp6_compact"
  top: "cluster00_cccp6_compact"
  name: "cluster00_relu6"
  type: "ReLU"
}

layer {
  bottom: "cluster00_cccp6_compact"
  top: "cluster00_poolg"
  name: "cluster00_poolg"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 6
    stride: 1
  }
}
layer {
	name: "cluster00_prob_compact"
	type: "Softmax"
	bottom: "cluster00_poolg"
	top: "cluster00_prob_compact"
}
layer {
  bottom: "pool1"
  top: "cluster01_conv2"
  name: "cluster01_conv2"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 1200
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster01_conv2_64_1200_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster01_conv2_64_1200_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster01_conv2"
    top: "cluster01_cccp3"
    name: "cluster01_cccp3"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster01_cccp3_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster01_cccp3_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster01_cccp3"
  top: "cluster01_cccp3"
  name: "cluster01_relu3"
  type: "ReLU"
}
layer {
    bottom: "cluster01_cccp3"
    top: "cluster01_cccp4"
    name: "cluster01_cccp4"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster01_cccp4_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster01_cccp4_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster01_cccp4"
  top: "cluster01_cccp4"
  name: "cluster01_relu4"
  type: "ReLU"
}


layer {
  bottom: "cluster01_cccp4"
  top: "cluster01_pool2"
  name: "cluster01_pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "cluster01_pool2"
  top: "cluster01_pool2"
  name: "cluster01_drop2"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  bottom: "cluster01_pool2"
  top: "cluster01_conv3"
  name: "cluster01_conv3"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 576
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster01_conv3_64_576_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster01_conv3_64_576_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster01_conv3"
    top: "cluster01_cccp5"
    name: "cluster01_cccp5"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster01_cccp5_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster01_cccp5_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster01_cccp5"
  top: "cluster01_cccp5"
  name: "cluster01_relu5"
  type: "ReLU"
}
layer {
    bottom: "cluster01_cccp5"
    top: "cluster01_cccp6_compact"
    name: "cluster01_cccp6_compact"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
		num_output: 51
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }   
  }
}
layer {
  bottom: "cluster01_cccp6_compact"
  top: "cluster01_cccp6_compact"
  name: "cluster01_relu6"
  type: "ReLU"
}

layer {
  bottom: "cluster01_cccp6_compact"
  top: "cluster01_poolg"
  name: "cluster01_poolg"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 6
    stride: 1
  }
}
layer {
	name: "cluster01_prob_compact"
	type: "Softmax"
	bottom: "cluster01_poolg"
	top: "cluster01_prob_compact"
}
layer {
  bottom: "pool1"
  top: "cluster02_conv2"
  name: "cluster02_conv2"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 1200
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster02_conv2_64_1200_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster02_conv2_64_1200_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster02_conv2"
    top: "cluster02_cccp3"
    name: "cluster02_cccp3"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster02_cccp3_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster02_cccp3_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster02_cccp3"
  top: "cluster02_cccp3"
  name: "cluster02_relu3"
  type: "ReLU"
}
layer {
    bottom: "cluster02_cccp3"
    top: "cluster02_cccp4"
    name: "cluster02_cccp4"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster02_cccp4_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster02_cccp4_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster02_cccp4"
  top: "cluster02_cccp4"
  name: "cluster02_relu4"
  type: "ReLU"
}


layer {
  bottom: "cluster02_cccp4"
  top: "cluster02_pool2"
  name: "cluster02_pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "cluster02_pool2"
  top: "cluster02_pool2"
  name: "cluster02_drop2"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  bottom: "cluster02_pool2"
  top: "cluster02_conv3"
  name: "cluster02_conv3"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 576
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster02_conv3_64_576_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster02_conv3_64_576_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster02_conv3"
    top: "cluster02_cccp5"
    name: "cluster02_cccp5"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster02_cccp5_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster02_cccp5_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster02_cccp5"
  top: "cluster02_cccp5"
  name: "cluster02_relu5"
  type: "ReLU"
}
layer {
    bottom: "cluster02_cccp5"
    top: "cluster02_cccp6_compact"
    name: "cluster02_cccp6_compact"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
		num_output: 80
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }   
  }
}
layer {
  bottom: "cluster02_cccp6_compact"
  top: "cluster02_cccp6_compact"
  name: "cluster02_relu6"
  type: "ReLU"
}

layer {
  bottom: "cluster02_cccp6_compact"
  top: "cluster02_poolg"
  name: "cluster02_poolg"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 6
    stride: 1
  }
}
layer {
	name: "cluster02_prob_compact"
	type: "Softmax"
	bottom: "cluster02_poolg"
	top: "cluster02_prob_compact"
}
layer {
  bottom: "pool1"
  top: "cluster03_conv2"
  name: "cluster03_conv2"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 1200
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster03_conv2_64_1200_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster03_conv2_64_1200_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster03_conv2"
    top: "cluster03_cccp3"
    name: "cluster03_cccp3"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster03_cccp3_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster03_cccp3_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster03_cccp3"
  top: "cluster03_cccp3"
  name: "cluster03_relu3"
  type: "ReLU"
}
layer {
    bottom: "cluster03_cccp3"
    top: "cluster03_cccp4"
    name: "cluster03_cccp4"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster03_cccp4_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster03_cccp4_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster03_cccp4"
  top: "cluster03_cccp4"
  name: "cluster03_relu4"
  type: "ReLU"
}


layer {
  bottom: "cluster03_cccp4"
  top: "cluster03_pool2"
  name: "cluster03_pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "cluster03_pool2"
  top: "cluster03_pool2"
  name: "cluster03_drop2"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  bottom: "cluster03_pool2"
  top: "cluster03_conv3"
  name: "cluster03_conv3"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 576
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster03_conv3_64_576_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster03_conv3_64_576_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster03_conv3"
    top: "cluster03_cccp5"
    name: "cluster03_cccp5"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster03_cccp5_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster03_cccp5_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster03_cccp5"
  top: "cluster03_cccp5"
  name: "cluster03_relu5"
  type: "ReLU"
}
layer {
    bottom: "cluster03_cccp5"
    top: "cluster03_cccp6_compact"
    name: "cluster03_cccp6_compact"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
		num_output: 80
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }   
  }
}
layer {
  bottom: "cluster03_cccp6_compact"
  top: "cluster03_cccp6_compact"
  name: "cluster03_relu6"
  type: "ReLU"
}

layer {
  bottom: "cluster03_cccp6_compact"
  top: "cluster03_poolg"
  name: "cluster03_poolg"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 6
    stride: 1
  }
}
layer {
	name: "cluster03_prob_compact"
	type: "Softmax"
	bottom: "cluster03_poolg"
	top: "cluster03_prob_compact"
}
layer {
  bottom: "pool1"
  top: "cluster04_conv2"
  name: "cluster04_conv2"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 1200
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster04_conv2_64_1200_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster04_conv2_64_1200_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster04_conv2"
    top: "cluster04_cccp3"
    name: "cluster04_cccp3"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster04_cccp3_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster04_cccp3_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster04_cccp3"
  top: "cluster04_cccp3"
  name: "cluster04_relu3"
  type: "ReLU"
}
layer {
    bottom: "cluster04_cccp3"
    top: "cluster04_cccp4"
    name: "cluster04_cccp4"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster04_cccp4_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster04_cccp4_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster04_cccp4"
  top: "cluster04_cccp4"
  name: "cluster04_relu4"
  type: "ReLU"
}


layer {
  bottom: "cluster04_cccp4"
  top: "cluster04_pool2"
  name: "cluster04_pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "cluster04_pool2"
  top: "cluster04_pool2"
  name: "cluster04_drop2"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  bottom: "cluster04_pool2"
  top: "cluster04_conv3"
  name: "cluster04_conv3"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 576
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster04_conv3_64_576_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster04_conv3_64_576_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster04_conv3"
    top: "cluster04_cccp5"
    name: "cluster04_cccp5"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster04_cccp5_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster04_cccp5_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
  bottom: "cluster04_cccp5"
  top: "cluster04_cccp5"
  name: "cluster04_relu5"
  type: "ReLU"
}
layer {
    bottom: "cluster04_cccp5"
    top: "cluster04_cccp6_compact"
    name: "cluster04_cccp6_compact"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
		num_output: 36
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }   
  }
}
layer {
  bottom: "cluster04_cccp6_compact"
  top: "cluster04_cccp6_compact"
  name: "cluster04_relu6"
  type: "ReLU"
}

layer {
  bottom: "cluster04_cccp6_compact"
  top: "cluster04_poolg"
  name: "cluster04_poolg"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 6
    stride: 1
  }
}
layer {
	name: "cluster04_prob_compact"
	type: "Softmax"
	bottom: "cluster04_poolg"
	top: "cluster04_prob_compact"
}
layer {
  bottom: "pool1"
  top: "cluster05_conv2"
  name: "cluster05_conv2"
  type: "Convolution"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 1200
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster05_conv2_64_1200_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster05_conv2_64_1200_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}

layer {
    bottom: "cluster05_conv2"
    top: "cluster05_cccp3"
    name: "cluster05_cccp3"
    type: "Convolution"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
		quantization_kmean_num_cluster: 64
		quantization_num_segment: 96
		quantization_kmean_cluster_centers_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster05_cccp3_64_96_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/cifar100_NIN_float_crop_v2/9clusters/9clusters_v0.0/iter_25000/cluster05_cccp3_64_96_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: false
	parameter_compress: false
}
layer {
