name: "VGG_ILSVRC_16_layer"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: true
    resize_short_side_min: 256
    resize_short_side_max: 512
  }
  data_param {
    source: "/home/zyan3/local/data/imagenet/ilsvrc12/ilsvrc12_train_encoded_lmdb"
	batch_size: 10
    backend: LMDB
    selective_list: "/home/zyan3/proj/caffe_private_hdcnn/data/ilsvrc12/train.txt"
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
    mirror: false
    resize_short_side_min: 384
    resize_short_side_max: 384
  }
  data_param {
    source: "/home/zyan3/local/data/imagenet/ilsvrc12/ilsvrc12_val_encoded_lmdb"
	batch_size: 50
    backend: LMDB
    selective_list: ""
  }
}

layer {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}

layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "Relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "Relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "Relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "Relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "Relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "Relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "Relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "Relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "Relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "Relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "Relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "Relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "Relu5_3"
  type: "ReLU"
}
layer {
  bottom: "conv5_3"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool5"
  top: "fc6"
  name: "fc6"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    quantization_kmean_num_cluster: 64
    quantization_num_segment: 1792
    quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/fc6_64_1792_kmean_cluster_centers.binaryproto"
    quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/fc6_64_1792_kmean_cluster_indices.binaryproto"
  }
  conserve_gpu_memory_test: true
  parameter_compress: false
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "Relu6"
  type: "ReLU"
}
layer {
  bottom: "fc6"
  top: "fc6"
  name: "drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc6"
  top: "fc7"
  name: "fc7"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    quantization_kmean_num_cluster: 256
    quantization_num_segment: 1024
    quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/fc7_256_1024_kmean_cluster_centers.binaryproto"
    quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/fc7_256_1024_kmean_cluster_indices.binaryproto"    
  }
  conserve_gpu_memory_test: true
  parameter_compress: false
}
layer {
  bottom: "fc7"
  top: "fc7"
  name: "Relu7"
  type: "ReLU"
}
layer {
  bottom: "fc7"
  top: "fc7"
  name: "drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "fc7"
  top: "fc8"
  name: "fc8"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 1000
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }     
  }
}

layer {
	name: "fine_branch_prob"
	type: "Softmax"
	bottom: "fc8"
	top: "fine_branch_prob"
}
layer {
	name: "coarse_branch_prob"
	type: "Fine2CoarseProb"
	bottom: "fine_branch_prob"
	top: "coarse_branch_prob"
	fine2coarse_prob_layer_param{
		num_coarse: 84
		fine2coarse: 52
		fine2coarse: 8
		fine2coarse: 0
		fine2coarse: 0
		fine2coarse: 0
		fine2coarse: 0
		fine2coarse: 0
		fine2coarse: 10
		fine2coarse: 19
		fine2coarse: 19
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 1
		fine2coarse: 2
		fine2coarse: 2
		fine2coarse: 1
		fine2coarse: 1
		fine2coarse: 2
		fine2coarse: 1
		fine2coarse: 2
		fine2coarse: 0
		fine2coarse: 0
		fine2coarse: 1
		fine2coarse: 1
		fine2coarse: 1
		fine2coarse: 2
		fine2coarse: 2
		fine2coarse: 1
		fine2coarse: 3
		fine2coarse: 3
		fine2coarse: 3
		fine2coarse: 3
		fine2coarse: 1
		fine2coarse: 3
		fine2coarse: 1
		fine2coarse: 2
		fine2coarse: 19
		fine2coarse: 1
		fine2coarse: 19
		fine2coarse: 5
		fine2coarse: 4
		fine2coarse: 5
		fine2coarse: 4
		fine2coarse: 4
		fine2coarse: 4
		fine2coarse: 5
		fine2coarse: 2
		fine2coarse: 5
		fine2coarse: 4
		fine2coarse: 4
		fine2coarse: 4
		fine2coarse: 4
		fine2coarse: 8
		fine2coarse: 4
		fine2coarse: 4
		fine2coarse: 4
		fine2coarse: 66
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 7
		fine2coarse: 7
		fine2coarse: 4
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 22
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 22
		fine2coarse: 10
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 8
		fine2coarse: 8
		fine2coarse: 8
		fine2coarse: 66
		fine2coarse: 6
		fine2coarse: 8
		fine2coarse: 8
		fine2coarse: 8
		fine2coarse: 9
		fine2coarse: 8
		fine2coarse: 66
		fine2coarse: 8
		fine2coarse: 9
		fine2coarse: 8
		fine2coarse: 9
		fine2coarse: 6
		fine2coarse: 9
		fine2coarse: 9
		fine2coarse: 9
		fine2coarse: 9
		fine2coarse: 10
		fine2coarse: 38
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 38
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 66
		fine2coarse: 10
		fine2coarse: 66
		fine2coarse: 19
		fine2coarse: 0
		fine2coarse: 0
		fine2coarse: 11
		fine2coarse: 18
		fine2coarse: 14
		fine2coarse: 38
		fine2coarse: 18
		fine2coarse: 18
		fine2coarse: 18
		fine2coarse: 11
		fine2coarse: 12
		fine2coarse: 18
		fine2coarse: 16
		fine2coarse: 16
		fine2coarse: 16
		fine2coarse: 16
		fine2coarse: 16
		fine2coarse: 16
		fine2coarse: 12
		fine2coarse: 12
		fine2coarse: 18
		fine2coarse: 14
		fine2coarse: 11
		fine2coarse: 11
		fine2coarse: 11
		fine2coarse: 19
		fine2coarse: 14
		fine2coarse: 12
		fine2coarse: 18
		fine2coarse: 16
		fine2coarse: 16
		fine2coarse: 12
		fine2coarse: 18
		fine2coarse: 13
		fine2coarse: 18
		fine2coarse: 13
		fine2coarse: 13
		fine2coarse: 13
		fine2coarse: 13
		fine2coarse: 14
		fine2coarse: 13
		fine2coarse: 14
		fine2coarse: 14
		fine2coarse: 13
		fine2coarse: 13
		fine2coarse: 13
		fine2coarse: 11
		fine2coarse: 14
		fine2coarse: 15
		fine2coarse: 18
		fine2coarse: 14
		fine2coarse: 14
		fine2coarse: 13
		fine2coarse: 14
		fine2coarse: 14
		fine2coarse: 14
		fine2coarse: 15
		fine2coarse: 15
		fine2coarse: 18
		fine2coarse: 12
		fine2coarse: 16
		fine2coarse: 16
		fine2coarse: 16
		fine2coarse: 15
		fine2coarse: 18
		fine2coarse: 15
		fine2coarse: 15
		fine2coarse: 18
		fine2coarse: 15
		fine2coarse: 15
		fine2coarse: 15
		fine2coarse: 15
		fine2coarse: 15
		fine2coarse: 17
		fine2coarse: 17
		fine2coarse: 15
		fine2coarse: 19
		fine2coarse: 15
		fine2coarse: 16
		fine2coarse: 18
		fine2coarse: 18
		fine2coarse: 17
		fine2coarse: 18
		fine2coarse: 17
		fine2coarse: 15
		fine2coarse: 17
		fine2coarse: 18
		fine2coarse: 16
		fine2coarse: 11
		fine2coarse: 16
		fine2coarse: 16
		fine2coarse: 17
		fine2coarse: 16
		fine2coarse: 12
		fine2coarse: 16
		fine2coarse: 15
		fine2coarse: 16
		fine2coarse: 12
		fine2coarse: 16
		fine2coarse: 17
		fine2coarse: 17
		fine2coarse: 17
		fine2coarse: 19
		fine2coarse: 18
		fine2coarse: 11
		fine2coarse: 19
		fine2coarse: 18
		fine2coarse: 15
		fine2coarse: 18
		fine2coarse: 19
		fine2coarse: 19
		fine2coarse: 18
		fine2coarse: 18
		fine2coarse: 19
		fine2coarse: 16
		fine2coarse: 16
		fine2coarse: 14
		fine2coarse: 14
		fine2coarse: 15
		fine2coarse: 11
		fine2coarse: 17
		fine2coarse: 19
		fine2coarse: 19
		fine2coarse: 22
		fine2coarse: 11
		fine2coarse: 19
		fine2coarse: 19
		fine2coarse: 22
		fine2coarse: 19
		fine2coarse: 19
		fine2coarse: 19
		fine2coarse: 23
		fine2coarse: 20
		fine2coarse: 20
		fine2coarse: 19
		fine2coarse: 20
		fine2coarse: 20
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 19
		fine2coarse: 19
		fine2coarse: 19
		fine2coarse: 23
		fine2coarse: 19
		fine2coarse: 19
		fine2coarse: 19
		fine2coarse: 23
		fine2coarse: 19
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 7
		fine2coarse: 21
		fine2coarse: 6
		fine2coarse: 21
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 7
		fine2coarse: 6
		fine2coarse: 21
		fine2coarse: 7
		fine2coarse: 7
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 6
		fine2coarse: 66
		fine2coarse: 66
		fine2coarse: 10
		fine2coarse: 6
		fine2coarse: 10
		fine2coarse: 19
		fine2coarse: 10
		fine2coarse: 9
		fine2coarse: 8
		fine2coarse: 9
		fine2coarse: 19
		fine2coarse: 23
		fine2coarse: 19
		fine2coarse: 10
		fine2coarse: 24
		fine2coarse: 23
		fine2coarse: 22
		fine2coarse: 19
		fine2coarse: 22
		fine2coarse: 10
		fine2coarse: 66
		fine2coarse: 22
		fine2coarse: 22
		fine2coarse: 22
		fine2coarse: 22
		fine2coarse: 22
		fine2coarse: 22
		fine2coarse: 22
		fine2coarse: 22
		fine2coarse: 22
		fine2coarse: 22
		fine2coarse: 19
		fine2coarse: 10
		fine2coarse: 10
		fine2coarse: 22
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 23
		fine2coarse: 19
		fine2coarse: 25
		fine2coarse: 23
		fine2coarse: 25
		fine2coarse: 25
		fine2coarse: 24
		fine2coarse: 24
		fine2coarse: 24
		fine2coarse: 24
		fine2coarse: 25
		fine2coarse: 25
		fine2coarse: 25
		fine2coarse: 25
		fine2coarse: 38
		fine2coarse: 24
		fine2coarse: 25
		fine2coarse: 25
		fine2coarse: 25
		fine2coarse: 25
		fine2coarse: 25
		fine2coarse: 23
		fine2coarse: 25
		fine2coarse: 22
		fine2coarse: 22
		fine2coarse: 19
		fine2coarse: 10
		fine2coarse: 0
		fine2coarse: 9
		fine2coarse: 49
		fine2coarse: 8
		fine2coarse: 8
		fine2coarse: 0
		fine2coarse: 1
		fine2coarse: 8
		fine2coarse: 9
		fine2coarse: 62
		fine2coarse: 26
		fine2coarse: 47
		fine2coarse: 38
		fine2coarse: 42
		fine2coarse: 27
		fine2coarse: 27
		fine2coarse: 27
		fine2coarse: 63
		fine2coarse: 28
		fine2coarse: 27
		fine2coarse: 61
		fine2coarse: 38
		fine2coarse: 33
		fine2coarse: 30
		fine2coarse: 58
		fine2coarse: 74
		fine2coarse: 79
		fine2coarse: 68
		fine2coarse: 68
		fine2coarse: 62
		fine2coarse: 76
		fine2coarse: 42
		fine2coarse: 29
		fine2coarse: 49
		fine2coarse: 44
		fine2coarse: 54
		fine2coarse: 67
		fine2coarse: 66
		fine2coarse: 30
		fine2coarse: 46
		fine2coarse: 66
		fine2coarse: 66
		fine2coarse: 20
		fine2coarse: 31
		fine2coarse: 32
		fine2coarse: 33
		fine2coarse: 34
		fine2coarse: 28
		fine2coarse: 67
		fine2coarse: 35
		fine2coarse: 38
		fine2coarse: 56
		fine2coarse: 35
		fine2coarse: 71
		fine2coarse: 33
		fine2coarse: 49
		fine2coarse: 32
		fine2coarse: 72
		fine2coarse: 57
		fine2coarse: 61
		fine2coarse: 67
		fine2coarse: 59
		fine2coarse: 36
		fine2coarse: 69
		fine2coarse: 37
		fine2coarse: 77
		fine2coarse: 36
		fine2coarse: 44
		fine2coarse: 49
		fine2coarse: 38
		fine2coarse: 32
		fine2coarse: 39
		fine2coarse: 59
		fine2coarse: 44
		fine2coarse: 48
		fine2coarse: 36
		fine2coarse: 49
		fine2coarse: 66
		fine2coarse: 40
		fine2coarse: 28
		fine2coarse: 43
		fine2coarse: 45
		fine2coarse: 27
		fine2coarse: 66
		fine2coarse: 62
		fine2coarse: 69
		fine2coarse: 38
		fine2coarse: 59
		fine2coarse: 58
		fine2coarse: 77
		fine2coarse: 28
		fine2coarse: 54
		fine2coarse: 41
		fine2coarse: 41
		fine2coarse: 71
		fine2coarse: 27
		fine2coarse: 41
		fine2coarse: 42
		fine2coarse: 41
		fine2coarse: 36
		fine2coarse: 75
		fine2coarse: 49
		fine2coarse: 46
		fine2coarse: 37
		fine2coarse: 37
		fine2coarse: 43
		fine2coarse: 37
		fine2coarse: 33
		fine2coarse: 71
		fine2coarse: 61
		fine2coarse: 62
		fine2coarse: 66
		fine2coarse: 26
		fine2coarse: 49
		fine2coarse: 35
		fine2coarse: 55
		fine2coarse: 55
		fine2coarse: 65
		fine2coarse: 38
		fine2coarse: 76
		fine2coarse: 77
		fine2coarse: 67
		fine2coarse: 28
		fine2coarse: 58
		fine2coarse: 31
		fine2coarse: 64
		fine2coarse: 49
		fine2coarse: 76
		fine2coarse: 67
		fine2coarse: 49
		fine2coarse: 37
		fine2coarse: 70
		fine2coarse: 78
		fine2coarse: 59
		fine2coarse: 44
		fine2coarse: 59
		fine2coarse: 39
		fine2coarse: 73
		fine2coarse: 41
		fine2coarse: 44
		fine2coarse: 33
		fine2coarse: 41
		fine2coarse: 41
		fine2coarse: 63
		fine2coarse: 66
		fine2coarse: 73
		fine2coarse: 19
		fine2coarse: 39
		fine2coarse: 17
		fine2coarse: 67
		fine2coarse: 72
		fine2coarse: 27
		fine2coarse: 42
		fine2coarse: 62
		fine2coarse: 59
		fine2coarse: 78
		fine2coarse: 65
		fine2coarse: 42
		fine2coarse: 66
		fine2coarse: 73
		fine2coarse: 72
		fine2coarse: 10
		fine2coarse: 45
		fine2coarse: 68
		fine2coarse: 37
		fine2coarse: 27
		fine2coarse: 28
		fine2coarse: 29
		fine2coarse: 67
		fine2coarse: 31
		fine2coarse: 46
		fine2coarse: 59
		fine2coarse: 46
		fine2coarse: 67
		fine2coarse: 62
		fine2coarse: 70
		fine2coarse: 66
		fine2coarse: 42
		fine2coarse: 78
		fine2coarse: 26
		fine2coarse: 66
		fine2coarse: 45
		fine2coarse: 54
		fine2coarse: 30
		fine2coarse: 66
		fine2coarse: 38
		fine2coarse: 28
		fine2coarse: 67
		fine2coarse: 43
		fine2coarse: 64
		fine2coarse: 31
		fine2coarse: 75
		fine2coarse: 28
		fine2coarse: 40
		fine2coarse: 44
		fine2coarse: 36
		fine2coarse: 45
		fine2coarse: 46
		fine2coarse: 62
		fine2coarse: 40
		fine2coarse: 45
		fine2coarse: 41
		fine2coarse: 33
		fine2coarse: 41
		fine2coarse: 31
		fine2coarse: 42
		fine2coarse: 46
		fine2coarse: 58
		fine2coarse: 58
		fine2coarse: 73
		fine2coarse: 69
		fine2coarse: 36
		fine2coarse: 26
		fine2coarse: 59
		fine2coarse: 46
		fine2coarse: 66
		fine2coarse: 41
		fine2coarse: 41
		fine2coarse: 38
		fine2coarse: 26
		fine2coarse: 28
		fine2coarse: 26
		fine2coarse: 38
		fine2coarse: 38
		fine2coarse: 38
		fine2coarse: 47
		fine2coarse: 49
		fine2coarse: 36
		fine2coarse: 45
		fine2coarse: 48
		fine2coarse: 65
		fine2coarse: 41
		fine2coarse: 46
		fine2coarse: 57
		fine2coarse: 62
		fine2coarse: 37
		fine2coarse: 27
		fine2coarse: 45
		fine2coarse: 28
		fine2coarse: 27
		fine2coarse: 45
		fine2coarse: 49
		fine2coarse: 45
		fine2coarse: 45
		fine2coarse: 45
		fine2coarse: 75
		fine2coarse: 68
		fine2coarse: 61
		fine2coarse: 61
		fine2coarse: 68
		fine2coarse: 68
		fine2coarse: 68
		fine2coarse: 68
		fine2coarse: 68
		fine2coarse: 68
		fine2coarse: 68
		fine2coarse: 49
		fine2coarse: 68
		fine2coarse: 83
		fine2coarse: 37
		fine2coarse: 22
		fine2coarse: 45
		fine2coarse: 50
		fine2coarse: 50
		fine2coarse: 50
		fine2coarse: 51
		fine2coarse: 50
		fine2coarse: 51
		fine2coarse: 51
		fine2coarse: 51
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 52
		fine2coarse: 53
		fine2coarse: 53
		fine2coarse: 53
		fine2coarse: 53
		fine2coarse: 53
		fine2coarse: 53
		fine2coarse: 50
		fine2coarse: 46
		fine2coarse: 59
		fine2coarse: 77
		fine2coarse: 59
		fine2coarse: 38
		fine2coarse: 58
		fine2coarse: 62
		fine2coarse: 70
		fine2coarse: 71
		fine2coarse: 42
		fine2coarse: 20
		fine2coarse: 66
		fine2coarse: 38
		fine2coarse: 75
		fine2coarse: 61
		fine2coarse: 28
		fine2coarse: 29
		fine2coarse: 54
		fine2coarse: 27
		fine2coarse: 72
		fine2coarse: 72
		fine2coarse: 56
		fine2coarse: 59
		fine2coarse: 73
		fine2coarse: 36
		fine2coarse: 66
		fine2coarse: 38
		fine2coarse: 28
		fine2coarse: 67
		fine2coarse: 38
		fine2coarse: 30
		fine2coarse: 33
		fine2coarse: 68
		fine2coarse: 44
		fine2coarse: 67
		fine2coarse: 55
		fine2coarse: 58
		fine2coarse: 66
		fine2coarse: 20
		fine2coarse: 73
		fine2coarse: 46
		fine2coarse: 31
		fine2coarse: 41
		fine2coarse: 52
		fine2coarse: 28
		fine2coarse: 69
		fine2coarse: 38
		fine2coarse: 56
		fine2coarse: 30
		fine2coarse: 30
		fine2coarse: 62
		fine2coarse: 70
		fine2coarse: 41
		fine2coarse: 29
		fine2coarse: 27
		fine2coarse: 57
		fine2coarse: 59
		fine2coarse: 47
		fine2coarse: 72
		fine2coarse: 62
		fine2coarse: 20
		fine2coarse: 28
		fine2coarse: 44
		fine2coarse: 52
		fine2coarse: 41
		fine2coarse: 66
		fine2coarse: 30
		fine2coarse: 66
		fine2coarse: 44
		fine2coarse: 57
		fine2coarse: 37
		fine2coarse: 41
		fine2coarse: 47
		fine2coarse: 58
		fine2coarse: 58
		fine2coarse: 70
		fine2coarse: 22
		fine2coarse: 62
		fine2coarse: 59
		fine2coarse: 10
		fine2coarse: 49
		fine2coarse: 66
		fine2coarse: 36
		fine2coarse: 35
		fine2coarse: 49
		fine2coarse: 47
		fine2coarse: 42
		fine2coarse: 58
		fine2coarse: 60
		fine2coarse: 66
		fine2coarse: 27
		fine2coarse: 61
		fine2coarse: 73
		fine2coarse: 10
		fine2coarse: 62
		fine2coarse: 76
		fine2coarse: 60
		fine2coarse: 43
		fine2coarse: 49
		fine2coarse: 63
		fine2coarse: 23
		fine2coarse: 19
		fine2coarse: 44
		fine2coarse: 68
		fine2coarse: 70
		fine2coarse: 59
		fine2coarse: 64
		fine2coarse: 33
		fine2coarse: 38
		fine2coarse: 63
		fine2coarse: 61
		fine2coarse: 0
		fine2coarse: 66
		fine2coarse: 46
		fine2coarse: 56
		fine2coarse: 49
		fine2coarse: 69
		fine2coarse: 38
		fine2coarse: 59
		fine2coarse: 78
		fine2coarse: 66
		fine2coarse: 65
		fine2coarse: 27
		fine2coarse: 48
		fine2coarse: 66
		fine2coarse: 6
		fine2coarse: 43
		fine2coarse: 28
		fine2coarse: 65
		fine2coarse: 31
		fine2coarse: 66
		fine2coarse: 67
		fine2coarse: 68
		fine2coarse: 36
		fine2coarse: 69
		fine2coarse: 61
		fine2coarse: 41
		fine2coarse: 60
		fine2coarse: 48
		fine2coarse: 61
		fine2coarse: 46
		fine2coarse: 70
		fine2coarse: 38
		fine2coarse: 27
		fine2coarse: 74
		fine2coarse: 38
		fine2coarse: 32
		fine2coarse: 74
		fine2coarse: 45
		fine2coarse: 67
		fine2coarse: 36
		fine2coarse: 26
		fine2coarse: 34
		fine2coarse: 49
		fine2coarse: 57
		fine2coarse: 45
		fine2coarse: 65
		fine2coarse: 66
		fine2coarse: 41
		fine2coarse: 30
		fine2coarse: 47
		fine2coarse: 41
		fine2coarse: 10
		fine2coarse: 38
		fine2coarse: 70
		fine2coarse: 35
		fine2coarse: 46
		fine2coarse: 70
		fine2coarse: 71
		fine2coarse: 73
		fine2coarse: 77
		fine2coarse: 30
		fine2coarse: 45
		fine2coarse: 19
		fine2coarse: 28
		fine2coarse: 77
		fine2coarse: 46
		fine2coarse: 46
		fine2coarse: 36
		fine2coarse: 47
		fine2coarse: 44
		fine2coarse: 27
		fine2coarse: 57
		fine2coarse: 38
		fine2coarse: 66
		fine2coarse: 42
		fine2coarse: 34
		fine2coarse: 29
		fine2coarse: 66
		fine2coarse: 68
		fine2coarse: 49
		fine2coarse: 42
		fine2coarse: 54
		fine2coarse: 55
		fine2coarse: 71
		fine2coarse: 33
		fine2coarse: 61
		fine2coarse: 69
		fine2coarse: 67
		fine2coarse: 31
		fine2coarse: 68
		fine2coarse: 38
		fine2coarse: 43
		fine2coarse: 72
		fine2coarse: 37
		fine2coarse: 27
		fine2coarse: 30
		fine2coarse: 73
		fine2coarse: 35
		fine2coarse: 55
		fine2coarse: 66
		fine2coarse: 55
		fine2coarse: 36
		fine2coarse: 47
		fine2coarse: 63
		fine2coarse: 63
		fine2coarse: 74
		fine2coarse: 56
		fine2coarse: 27
		fine2coarse: 48
		fine2coarse: 48
		fine2coarse: 69
		fine2coarse: 75
		fine2coarse: 67
		fine2coarse: 27
		fine2coarse: 38
		fine2coarse: 38
		fine2coarse: 77
		fine2coarse: 76
		fine2coarse: 61
		fine2coarse: 61
		fine2coarse: 77
		fine2coarse: 38
		fine2coarse: 82
		fine2coarse: 82
		fine2coarse: 78
		fine2coarse: 78
		fine2coarse: 81
		fine2coarse: 82
		fine2coarse: 68
		fine2coarse: 79
		fine2coarse: 79
		fine2coarse: 79
		fine2coarse: 79
		fine2coarse: 79
		fine2coarse: 82
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 80
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 66
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 79
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 22
		fine2coarse: 81
		fine2coarse: 82
		fine2coarse: 79
		fine2coarse: 79
		fine2coarse: 79
		fine2coarse: 82
		fine2coarse: 79
		fine2coarse: 30
		fine2coarse: 83
		fine2coarse: 30
		fine2coarse: 35
		fine2coarse: 67
		fine2coarse: 59
		fine2coarse: 39
		fine2coarse: 9
		fine2coarse: 10
		fine2coarse: 39
		fine2coarse: 39
		fine2coarse: 39
		fine2coarse: 39
		fine2coarse: 39
		fine2coarse: 39
		fine2coarse: 59
		fine2coarse: 49
		fine2coarse: 0
		fine2coarse: 22
		fine2coarse: 66
		fine2coarse: 66
		fine2coarse: 82
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 66
		fine2coarse: 66
		fine2coarse: 38
		fine2coarse: 8
		fine2coarse: 8
		fine2coarse: 8
		fine2coarse: 81
		fine2coarse: 81
		fine2coarse: 20
	}
}
layer {
  bottom: "pool4"
  top: "cluster00_conv5_1"
  name: "cluster00_conv5_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster00_conv5_1"
  top: "cluster00_conv5_1"
  name: "cluster00_Relu5_1"
  type: "ReLU"
}
layer {
  bottom: "cluster00_conv5_1"
  top: "cluster00_conv5_2"
  name: "cluster00_conv5_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster00_conv5_2"
  top: "cluster00_conv5_2"
  name: "cluster00_Relu5_2"
  type: "ReLU"
}
layer {
  bottom: "cluster00_conv5_2"
  top: "cluster00_conv5_3"
  name: "cluster00_conv5_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster00_conv5_3"
  top: "cluster00_conv5_3"
  name: "cluster00_Relu5_3"
  type: "ReLU"
}
layer {
  bottom: "cluster00_conv5_3"
  top: "cluster00_pool5"
  name: "cluster00_pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "cluster00_pool5"
  top: "cluster00_fc6"
  name: "cluster00_fc6"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
		quantization_kmean_num_cluster: 128
		quantization_num_segment: 1792
		quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster00_fc6_128_1792_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster00_fc6_128_1792_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: true
	parameter_compress: true
}
layer {
  bottom: "cluster00_fc6"
  top: "cluster00_fc6"
  name: "cluster00_Relu6"
  type: "ReLU"
}
layer {
  bottom: "cluster00_fc6"
  top: "cluster00_fc6"
  name: "cluster00_drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "cluster00_fc6"
  top: "cluster00_fc7"
  name: "cluster00_fc7"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
		quantization_kmean_num_cluster: 256
		quantization_num_segment: 1024
		quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster00_fc7_256_1024_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster00_fc7_256_1024_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: true
	parameter_compress: true
}
layer {
  bottom: "cluster00_fc7"
  top: "cluster00_fc7"
  name: "cluster00_Relu7"
  type: "ReLU"
}
layer {
  bottom: "cluster00_fc7"
  top: "cluster00_fc7"
  name: "cluster00_drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "cluster00_fc7"
  top: "cluster00_fc8_compact"
  name: "cluster00_fc8_compact"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
	num_output: 101
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }     
  }
}

layer {
name: "cluster00_prob_compact"
type: "Softmax"
bottom: "cluster00_fc8_compact"
top: "cluster00_prob_compact"
}
layer {
  bottom: "pool4"
  top: "cluster01_conv5_1"
  name: "cluster01_conv5_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster01_conv5_1"
  top: "cluster01_conv5_1"
  name: "cluster01_Relu5_1"
  type: "ReLU"
}
layer {
  bottom: "cluster01_conv5_1"
  top: "cluster01_conv5_2"
  name: "cluster01_conv5_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster01_conv5_2"
  top: "cluster01_conv5_2"
  name: "cluster01_Relu5_2"
  type: "ReLU"
}
layer {
  bottom: "cluster01_conv5_2"
  top: "cluster01_conv5_3"
  name: "cluster01_conv5_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster01_conv5_3"
  top: "cluster01_conv5_3"
  name: "cluster01_Relu5_3"
  type: "ReLU"
}
layer {
  bottom: "cluster01_conv5_3"
  top: "cluster01_pool5"
  name: "cluster01_pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "cluster01_pool5"
  top: "cluster01_fc6"
  name: "cluster01_fc6"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
		quantization_kmean_num_cluster: 128
		quantization_num_segment: 1792
		quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster01_fc6_128_1792_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster01_fc6_128_1792_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: true
	parameter_compress: true
}
layer {
  bottom: "cluster01_fc6"
  top: "cluster01_fc6"
  name: "cluster01_Relu6"
  type: "ReLU"
}
layer {
  bottom: "cluster01_fc6"
  top: "cluster01_fc6"
  name: "cluster01_drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "cluster01_fc6"
  top: "cluster01_fc7"
  name: "cluster01_fc7"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
		quantization_kmean_num_cluster: 256
		quantization_num_segment: 1024
		quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster01_fc7_256_1024_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster01_fc7_256_1024_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: true
	parameter_compress: true
}
layer {
  bottom: "cluster01_fc7"
  top: "cluster01_fc7"
  name: "cluster01_Relu7"
  type: "ReLU"
}
layer {
  bottom: "cluster01_fc7"
  top: "cluster01_fc7"
  name: "cluster01_drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "cluster01_fc7"
  top: "cluster01_fc8_compact"
  name: "cluster01_fc8_compact"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
	num_output: 101
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }     
  }
}

layer {
name: "cluster01_prob_compact"
type: "Softmax"
bottom: "cluster01_fc8_compact"
top: "cluster01_prob_compact"
}
layer {
  bottom: "pool4"
  top: "cluster02_conv5_1"
  name: "cluster02_conv5_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster02_conv5_1"
  top: "cluster02_conv5_1"
  name: "cluster02_Relu5_1"
  type: "ReLU"
}
layer {
  bottom: "cluster02_conv5_1"
  top: "cluster02_conv5_2"
  name: "cluster02_conv5_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster02_conv5_2"
  top: "cluster02_conv5_2"
  name: "cluster02_Relu5_2"
  type: "ReLU"
}
layer {
  bottom: "cluster02_conv5_2"
  top: "cluster02_conv5_3"
  name: "cluster02_conv5_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster02_conv5_3"
  top: "cluster02_conv5_3"
  name: "cluster02_Relu5_3"
  type: "ReLU"
}
layer {
  bottom: "cluster02_conv5_3"
  top: "cluster02_pool5"
  name: "cluster02_pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "cluster02_pool5"
  top: "cluster02_fc6"
  name: "cluster02_fc6"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
		quantization_kmean_num_cluster: 128
		quantization_num_segment: 1792
		quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster02_fc6_128_1792_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster02_fc6_128_1792_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: true
	parameter_compress: true
}
layer {
  bottom: "cluster02_fc6"
  top: "cluster02_fc6"
  name: "cluster02_Relu6"
  type: "ReLU"
}
layer {
  bottom: "cluster02_fc6"
  top: "cluster02_fc6"
  name: "cluster02_drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "cluster02_fc6"
  top: "cluster02_fc7"
  name: "cluster02_fc7"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
		quantization_kmean_num_cluster: 256
		quantization_num_segment: 1024
		quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster02_fc7_256_1024_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster02_fc7_256_1024_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: true
	parameter_compress: true
}
layer {
  bottom: "cluster02_fc7"
  top: "cluster02_fc7"
  name: "cluster02_Relu7"
  type: "ReLU"
}
layer {
  bottom: "cluster02_fc7"
  top: "cluster02_fc7"
  name: "cluster02_drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "cluster02_fc7"
  top: "cluster02_fc8_compact"
  name: "cluster02_fc8_compact"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
	num_output: 89
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }     
  }
}

layer {
name: "cluster02_prob_compact"
type: "Softmax"
bottom: "cluster02_fc8_compact"
top: "cluster02_prob_compact"
}
layer {
  bottom: "pool4"
  top: "cluster03_conv5_1"
  name: "cluster03_conv5_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster03_conv5_1"
  top: "cluster03_conv5_1"
  name: "cluster03_Relu5_1"
  type: "ReLU"
}
layer {
  bottom: "cluster03_conv5_1"
  top: "cluster03_conv5_2"
  name: "cluster03_conv5_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster03_conv5_2"
  top: "cluster03_conv5_2"
  name: "cluster03_Relu5_2"
  type: "ReLU"
}
layer {
  bottom: "cluster03_conv5_2"
  top: "cluster03_conv5_3"
  name: "cluster03_conv5_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster03_conv5_3"
  top: "cluster03_conv5_3"
  name: "cluster03_Relu5_3"
  type: "ReLU"
}
layer {
  bottom: "cluster03_conv5_3"
  top: "cluster03_pool5"
  name: "cluster03_pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "cluster03_pool5"
  top: "cluster03_fc6"
  name: "cluster03_fc6"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
		quantization_kmean_num_cluster: 128
		quantization_num_segment: 1792
		quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster03_fc6_128_1792_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster03_fc6_128_1792_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: true
	parameter_compress: true
}
layer {
  bottom: "cluster03_fc6"
  top: "cluster03_fc6"
  name: "cluster03_Relu6"
  type: "ReLU"
}
layer {
  bottom: "cluster03_fc6"
  top: "cluster03_fc6"
  name: "cluster03_drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "cluster03_fc6"
  top: "cluster03_fc7"
  name: "cluster03_fc7"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
		quantization_kmean_num_cluster: 256
		quantization_num_segment: 1024
		quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster03_fc7_256_1024_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster03_fc7_256_1024_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: true
	parameter_compress: true
}
layer {
  bottom: "cluster03_fc7"
  top: "cluster03_fc7"
  name: "cluster03_Relu7"
  type: "ReLU"
}
layer {
  bottom: "cluster03_fc7"
  top: "cluster03_fc7"
  name: "cluster03_drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "cluster03_fc7"
  top: "cluster03_fc8_compact"
  name: "cluster03_fc8_compact"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
	num_output: 48
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }     
  }
}

layer {
name: "cluster03_prob_compact"
type: "Softmax"
bottom: "cluster03_fc8_compact"
top: "cluster03_prob_compact"
}
layer {
  bottom: "pool4"
  top: "cluster04_conv5_1"
  name: "cluster04_conv5_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster04_conv5_1"
  top: "cluster04_conv5_1"
  name: "cluster04_Relu5_1"
  type: "ReLU"
}
layer {
  bottom: "cluster04_conv5_1"
  top: "cluster04_conv5_2"
  name: "cluster04_conv5_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster04_conv5_2"
  top: "cluster04_conv5_2"
  name: "cluster04_Relu5_2"
  type: "ReLU"
}
layer {
  bottom: "cluster04_conv5_2"
  top: "cluster04_conv5_3"
  name: "cluster04_conv5_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster04_conv5_3"
  top: "cluster04_conv5_3"
  name: "cluster04_Relu5_3"
  type: "ReLU"
}
layer {
  bottom: "cluster04_conv5_3"
  top: "cluster04_pool5"
  name: "cluster04_pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "cluster04_pool5"
  top: "cluster04_fc6"
  name: "cluster04_fc6"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
		quantization_kmean_num_cluster: 128
		quantization_num_segment: 1792
		quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster04_fc6_128_1792_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster04_fc6_128_1792_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: true
	parameter_compress: true
}
layer {
  bottom: "cluster04_fc6"
  top: "cluster04_fc6"
  name: "cluster04_Relu6"
  type: "ReLU"
}
layer {
  bottom: "cluster04_fc6"
  top: "cluster04_fc6"
  name: "cluster04_drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "cluster04_fc6"
  top: "cluster04_fc7"
  name: "cluster04_fc7"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
		quantization_kmean_num_cluster: 256
		quantization_num_segment: 1024
		quantization_kmean_cluster_centers_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster04_fc7_256_1024_kmean_cluster_centers.binaryproto"
		quantization_kmean_cluster_indices_file: "models/VGG_ILSVRC_16_layers/211839e770f7b538e2d8/84clusters/84clusters_v2.0/iter_12000/cluster04_fc7_256_1024_kmean_cluster_indices.binaryproto"
  }
	conserve_gpu_memory_test: true
	parameter_compress: true
}
layer {
  bottom: "cluster04_fc7"
  top: "cluster04_fc7"
  name: "cluster04_Relu7"
  type: "ReLU"
}
layer {
  bottom: "cluster04_fc7"
  top: "cluster04_fc7"
  name: "cluster04_drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  bottom: "cluster04_fc7"
  top: "cluster04_fc8_compact"
  name: "cluster04_fc8_compact"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
	num_output: 84
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }     
  }
}

layer {
name: "cluster04_prob_compact"
type: "Softmax"
bottom: "cluster04_fc8_compact"
top: "cluster04_prob_compact"
}
layer {
  bottom: "pool4"
  top: "cluster05_conv5_1"
  name: "cluster05_conv5_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster05_conv5_1"
  top: "cluster05_conv5_1"
  name: "cluster05_Relu5_1"
  type: "ReLU"
}
layer {
  bottom: "cluster05_conv5_1"
  top: "cluster05_conv5_2"
  name: "cluster05_conv5_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster05_conv5_2"
  top: "cluster05_conv5_2"
  name: "cluster05_Relu5_2"
  type: "ReLU"
}
layer {
  bottom: "cluster05_conv5_2"
  top: "cluster05_conv5_3"
  name: "cluster05_conv5_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  conserve_gpu_memory_test: true  
}
layer {
  bottom: "cluster05_conv5_3"
  top: "cluster05_conv5_3"
  name: "cluster05_Relu5_3"
  type: "ReLU"
}
layer {
  bottom: "cluster05_conv5_3"
  top: "cluster05_pool5"
  name: "cluster05_pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "cluster05_pool5"
  top: "cluster05_fc6"
  name: "cluster05_fc6"
  type: "InnerProduct"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }  
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.1
