name: "CIFAR100_NIN_float_crop_v2_train_test"
layer {
  name: "cifar"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 26
    mean_file: "data/cifar100/float_mean.binaryproto"
  }    
  data_param {
    source: "examples/cifar100/cifar100-float-train-train-val-leveldb/cifar100-train-leveldb"
    batch_size: 100
    backend: LEVELDB
  }
}
layer {
  name: "cifar"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 26
    mean_file: "data/cifar100/float_mean.binaryproto"
  }    
  data_param {
    source: "examples/cifar100/cifar100-float-train-train-val-leveldb/cifar100-test-leveldb"
    batch_size: 100
    backend: LEVELDB
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
    name: "cccp1"
    type: "Convolution"
    bottom: "conv1"
    top: "cccp1"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 160
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
   }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "cccp1"
  top: "cccp1"
} 
layer {
    name: "cccp2"
    type: "Convolution"
    bottom: "cccp1"
    top: "cccp2"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 96
        kernel_size: 1
        stride: 1            
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
   }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "cccp2"
  top: "cccp2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "cccp2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "drop1"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
  bottom: "pool1"
  top: "pool1"
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
    name: "cccp3"
    type: "Convolution"
    bottom: "conv2"
    top: "cccp3"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
   }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "cccp3"
  top: "cccp3"
}
layer {
    name: "cccp4"
    type: "Convolution"
    bottom: "cccp3"
    top: "cccp4"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
   }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "cccp4"
  top: "cccp4"
}


layer {
  name: "pool2"
  type: "Pooling"
  bottom: "cccp4"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop2"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
  bottom: "pool2"
  top: "pool2"
}

layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
    param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
    name: "cccp5"
    type: "Convolution"
    bottom: "conv3"
    top: "cccp5"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 192
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
   }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "cccp5"
  top: "cccp5"
}
layer {
    name: "cccp6"
    type: "Convolution"
    bottom: "cccp5"
    top: "cccp6"
      param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
    convolution_param {
        num_output: 100
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
   }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "cccp6"
  top: "cccp6"
}

layer {
  name: "poolg"
  type: "Pooling"
  bottom: "cccp6"
  top: "poolg"
  pooling_param {
    pool: AVE
    kernel_size: 6
    stride: 1
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "poolg"
  bottom: "label"
  top: "loss"
}

layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "poolg"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}