name: "hdcnn_CIFAR100_NIN_float_crop_v2_deploy"
input: "data"
input_dim: 20
input_dim: 3
input_dim: 224
input_dim: 224


layer {
    bottom: "data"
    top: "conv1"
    name: "conv1"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }        
    convolution_param {
        num_output: 96
        kernel_size: 11
        stride: 4
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.01
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
     }
}
layer {
  bottom: "conv1"
  top: "conv1"
  name: "relu0"
  type: "ReLU"
}
layer {
    bottom: "conv1"
    top: "cccp1"
    name: "cccp1"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }    
    convolution_param {
        num_output: 96
        kernel_size: 1
        stride: 1
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
   }
}
layer {
    bottom: "cccp1"
    top: "cccp1"
    name: "relu1"
    type: "ReLU"
}
layer {
    bottom: "cccp1"
    top: "cccp2"
    name: "cccp2"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }    
    convolution_param {
        num_output: 96
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
    }
}
layer {
    bottom: "cccp2"
    top: "cccp2"
    name: "relu2"
    type: "ReLU"
}
layer {
    bottom: "cccp2"
    top: "pool0"
    name: "pool0"
    type: "Pooling" 
    pooling_param {
        pool: MAX
        kernel_size: 3
        stride: 2
    }
}
layer {
    bottom: "pool0"
    top: "conv2"
    name: "conv2"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 256
        kernel_size: 5
        pad: 2
        stride: 1
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
    }
}
layer {
    bottom: "conv2"
    top: "conv2"
    name: "relu3"
    type: "ReLU"
}
layer {
    bottom: "conv2"
    top: "cccp3"
    name: "cccp3"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 256
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
    }
}
layer {
    bottom: "cccp3"
    top: "cccp3"
    name: "relu5"
    type: "ReLU"
}
layer {
    bottom: "cccp3"
    top: "cccp4"
    name: "cccp4"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 256
        kernel_size: 1
        stride: 1         
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
    }
}
layer {
    bottom: "cccp4"
    top: "cccp4"
    name: "relu6"
    type: "ReLU"
}
layer {
    bottom: "cccp4"
    top: "pool2"
    name: "pool2"
    type: "Pooling"
    pooling_param {
        pool: MAX
        kernel_size: 3
        stride: 2
    }
}
layer {
    bottom: "pool2"
    top: "conv3"
    name: "conv3"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 384
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.01
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
    }
}
layer {
  bottom: "conv3"
  top: "conv3"
  name: "relu7"
  type: "ReLU"
}
layer {
    name: "cccp5"
    type: "Convolution"
    bottom: "conv3"
    top: "cccp5"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 384
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
    }
}
layer {
  bottom: "cccp5"
  top: "cccp5"
  name: "relu8"
  type: "ReLU"
}
layer {
    bottom: "cccp5"
    top: "cccp6"
    name: "cccp6"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 384
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
   }
}
layer {
  bottom: "cccp6"
  top: "cccp6"
  name: "relu9"
  type: "ReLU"
}
layer {
    bottom: "cccp6"
    top: "pool3"
    name: "pool3"
    type: "Pooling"
    pooling_param {
        pool: MAX
        kernel_size: 3
        stride: 2
    }
}
layer {
    bottom: "pool3"
    top: "pool3"
    name: "drop"
    type: "Dropout"
    dropout_param {
        dropout_ratio: 0.5
    }
}
layer {
    bottom: "pool3"
    top: "conv4-1024"
    name: "conv4-1024"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 1024
        kernel_size: 3
        pad: 1
        stride: 1
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
        quantization_kmean_num_cluster: 0
        quantization_num_segment: 1152
        quantization_kmean_cluster_centers_file: "models/nin_imagenet/conv4-1024_128_1152_kmean_cluster_centers.binaryproto"
        quantization_kmean_cluster_indices_file: "models/nin_imagenet/conv4-1024_128_1152_kmean_cluster_indices.binaryproto"        
    }
    conserve_gpu_memory_test: false
    parameter_compress: false
}
layer {
    bottom: "conv4-1024"
    top: "conv4-1024"
    name: "relu10"
    type: "ReLU"
}
layer {
    bottom: "conv4-1024"
    top: "cccp7-1024"
    name: "cccp7-1024"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 1024
        kernel_size: 1
        stride: 1        
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.05
        }
        bias_filler {
            type: "constant"
            value: 0.
        }
        quantization_kmean_num_cluster: 0
        quantization_num_segment: 512
        quantization_kmean_cluster_centers_file: "models/nin_imagenet/cccp7-1024_256_512_kmean_cluster_centers.binaryproto"
        quantization_kmean_cluster_indices_file: "models/nin_imagenet/cccp7-1024_256_512_kmean_cluster_indices.binaryproto"         
    }
    conserve_gpu_memory_test: false
    parameter_compress: false
}
layer {
    bottom: "cccp7-1024"
    top: "cccp7-1024"
    name: "relu11"
    type: "ReLU"
}
layer {
    bottom: "cccp7-1024"
    top: "cccp8-1024"
    name: "cccp8-1024"
    type: "Convolution"
    param {
        lr_mult: 1
        decay_mult: 1
    }
    param {
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param {
        num_output: 1000
        kernel_size: 1
        stride: 1           
        weight_filler {
            type: "gaussian"
            mean: 0.
            std: 0.01
        }
        bias_filler {
            type: "constant"
            value: 0.
        }        
    }
}
layer {
  bottom: "cccp8-1024"
  top: "cccp8-1024"
  name: "relu12"
  type: "ReLU"
}
layer {
    bottom: "cccp8-1024"
    top: "pool4"
    name: "pool4"
    type: "Pooling"
    pooling_param {
        pool: AVE
        kernel_size: 6
        stride: 1
    }
}

layer {
	name: "fine_branch_prob"
	type: "Softmax"
	bottom: "pool4"
	top: "fine_branch_prob"
}
layer {
	name: "coarse_branch_prob"
	type: "Fine2MultiCoarseProb"
	bottom: "fine_branch_prob"
	top: "coarse_branch_prob"
	fine2multicoarse_prob_layer_param{
		num_coarse: 89
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 64
			coarse_id: 77
		}
		fine2multicoarse_param{
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 62
			coarse_id: 64
			coarse_id: 70
			coarse_id: 77
			coarse_id: 86
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 15
			coarse_id: 65
			coarse_id: 86
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 10
			coarse_id: 15
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 10
			coarse_id: 15
			coarse_id: 18
			coarse_id: 71
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 7
			coarse_id: 10
			coarse_id: 15
			coarse_id: 35
			coarse_id: 37
			coarse_id: 85
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 2
			coarse_id: 3
			coarse_id: 10
			coarse_id: 15
			coarse_id: 35
			coarse_id: 37
			coarse_id: 39
			coarse_id: 42
			coarse_id: 75
			coarse_id: 77
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 9
			coarse_id: 11
			coarse_id: 12
			coarse_id: 18
			coarse_id: 19
			coarse_id: 36
			coarse_id: 45
			coarse_id: 70
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 8
			coarse_id: 9
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 19
			coarse_id: 33
			coarse_id: 36
			coarse_id: 37
			coarse_id: 38
			coarse_id: 45
			coarse_id: 49
		}
		fine2multicoarse_param{
			coarse_id: 8
			coarse_id: 9
			coarse_id: 29
			coarse_id: 31
			coarse_id: 35
			coarse_id: 36
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 9
			coarse_id: 12
			coarse_id: 14
			coarse_id: 32
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 5
			coarse_id: 34
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 12
			coarse_id: 14
			coarse_id: 34
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 28
			coarse_id: 38
			coarse_id: 85
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 13
			coarse_id: 33
			coarse_id: 34
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 9
			coarse_id: 12
			coarse_id: 15
			coarse_id: 30
			coarse_id: 33
			coarse_id: 34
			coarse_id: 38
			coarse_id: 39
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 12
			coarse_id: 13
			coarse_id: 34
			coarse_id: 38
			coarse_id: 85
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 8
			coarse_id: 13
			coarse_id: 33
			coarse_id: 34
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 8
			coarse_id: 9
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 36
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 8
			coarse_id: 12
			coarse_id: 33
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 6
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 15
			coarse_id: 33
			coarse_id: 37
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 3
			coarse_id: 8
			coarse_id: 9
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 18
			coarse_id: 38
			coarse_id: 49
			coarse_id: 71
			coarse_id: 74
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 6
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 38
			coarse_id: 49
			coarse_id: 74
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 16
			coarse_id: 18
			coarse_id: 36
			coarse_id: 38
			coarse_id: 49
			coarse_id: 74
		}
		fine2multicoarse_param{
			coarse_id: 8
			coarse_id: 9
			coarse_id: 12
			coarse_id: 33
			coarse_id: 37
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 33
			coarse_id: 34
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
			coarse_id: 10
			coarse_id: 11
			coarse_id: 30
			coarse_id: 33
			coarse_id: 34
			coarse_id: 44
			coarse_id: 64
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 82
			coarse_id: 85
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 7
			coarse_id: 11
			coarse_id: 33
			coarse_id: 34
			coarse_id: 82
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 5
			coarse_id: 6
			coarse_id: 10
			coarse_id: 33
			coarse_id: 44
			coarse_id: 84
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 9
			coarse_id: 10
			coarse_id: 11
			coarse_id: 25
			coarse_id: 64
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 11
			coarse_id: 33
			coarse_id: 83
			coarse_id: 84
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 12
			coarse_id: 33
			coarse_id: 37
			coarse_id: 84
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 15
			coarse_id: 33
			coarse_id: 87
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 9
			coarse_id: 10
			coarse_id: 11
			coarse_id: 14
			coarse_id: 15
			coarse_id: 18
			coarse_id: 23
			coarse_id: 33
			coarse_id: 37
			coarse_id: 65
			coarse_id: 86
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 15
			coarse_id: 33
			coarse_id: 37
			coarse_id: 42
			coarse_id: 87
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
			coarse_id: 10
			coarse_id: 13
			coarse_id: 15
			coarse_id: 33
			coarse_id: 34
			coarse_id: 37
			coarse_id: 66
			coarse_id: 84
			coarse_id: 86
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 6
			coarse_id: 7
			coarse_id: 16
			coarse_id: 32
			coarse_id: 33
			coarse_id: 77
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 30
			coarse_id: 32
			coarse_id: 33
			coarse_id: 64
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 9
			coarse_id: 13
			coarse_id: 30
			coarse_id: 38
			coarse_id: 83
			coarse_id: 86
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 11
			coarse_id: 33
			coarse_id: 84
			coarse_id: 85
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 11
			coarse_id: 33
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 12
			coarse_id: 33
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 11
			coarse_id: 12
			coarse_id: 30
			coarse_id: 32
			coarse_id: 33
			coarse_id: 34
			coarse_id: 38
			coarse_id: 86
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 64
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 33
			coarse_id: 65
			coarse_id: 77
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 33
			coarse_id: 83
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 12
			coarse_id: 33
			coarse_id: 34
			coarse_id: 39
			coarse_id: 61
			coarse_id: 84
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 9
			coarse_id: 24
			coarse_id: 30
			coarse_id: 31
			coarse_id: 32
			coarse_id: 37
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
			coarse_id: 10
			coarse_id: 14
			coarse_id: 15
			coarse_id: 30
			coarse_id: 32
			coarse_id: 36
			coarse_id: 37
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
			coarse_id: 10
			coarse_id: 12
			coarse_id: 14
			coarse_id: 15
			coarse_id: 32
			coarse_id: 37
			coarse_id: 52
			coarse_id: 64
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 18
			coarse_id: 35
			coarse_id: 36
			coarse_id: 59
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 64
			coarse_id: 74
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 14
			coarse_id: 34
			coarse_id: 64
			coarse_id: 70
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 12
			coarse_id: 33
			coarse_id: 64
			coarse_id: 70
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 33
			coarse_id: 83
			coarse_id: 84
			coarse_id: 85
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 64
			coarse_id: 83
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 12
			coarse_id: 64
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
			coarse_id: 10
			coarse_id: 11
			coarse_id: 12
			coarse_id: 14
			coarse_id: 15
			coarse_id: 33
			coarse_id: 34
			coarse_id: 36
			coarse_id: 37
			coarse_id: 64
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 33
			coarse_id: 84
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 34
			coarse_id: 38
			coarse_id: 64
			coarse_id: 83
			coarse_id: 85
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 11
			coarse_id: 33
			coarse_id: 83
			coarse_id: 84
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 64
			coarse_id: 83
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
			coarse_id: 10
			coarse_id: 11
			coarse_id: 12
			coarse_id: 14
			coarse_id: 30
			coarse_id: 64
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 33
			coarse_id: 64
			coarse_id: 84
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 15
			coarse_id: 33
			coarse_id: 64
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 31
			coarse_id: 33
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 33
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 7
			coarse_id: 9
			coarse_id: 10
			coarse_id: 30
			coarse_id: 31
			coarse_id: 32
			coarse_id: 33
			coarse_id: 39
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 7
			coarse_id: 10
			coarse_id: 15
			coarse_id: 33
			coarse_id: 70
			coarse_id: 75
			coarse_id: 77
			coarse_id: 83
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 11
			coarse_id: 33
			coarse_id: 34
			coarse_id: 66
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 15
			coarse_id: 33
			coarse_id: 34
			coarse_id: 83
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 33
			coarse_id: 34
			coarse_id: 49
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 6
			coarse_id: 11
			coarse_id: 33
			coarse_id: 34
			coarse_id: 49
			coarse_id: 82
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 11
			coarse_id: 33
			coarse_id: 34
			coarse_id: 39
			coarse_id: 49
		}
		fine2multicoarse_param{
			coarse_id: 33
			coarse_id: 34
			coarse_id: 77
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 7
			coarse_id: 11
			coarse_id: 33
			coarse_id: 66
			coarse_id: 82
			coarse_id: 83
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 11
			coarse_id: 33
			coarse_id: 34
			coarse_id: 82
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 31
			coarse_id: 33
			coarse_id: 34
			coarse_id: 85
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 34
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 26
			coarse_id: 37
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
			coarse_id: 9
			coarse_id: 10
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 9
			coarse_id: 12
			coarse_id: 14
			coarse_id: 33
			coarse_id: 37
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 8
			coarse_id: 9
			coarse_id: 12
			coarse_id: 14
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 8
			coarse_id: 13
			coarse_id: 33
			coarse_id: 34
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 4
			coarse_id: 8
			coarse_id: 9
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 30
			coarse_id: 31
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 6
			coarse_id: 9
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 30
		}
		fine2multicoarse_param{
			coarse_id: 15
			coarse_id: 38
			coarse_id: 66
			coarse_id: 71
		}
		fine2multicoarse_param{
			coarse_id: 11
			coarse_id: 13
			coarse_id: 39
			coarse_id: 66
			coarse_id: 82
		}
		fine2multicoarse_param{
			coarse_id: 8
			coarse_id: 12
			coarse_id: 31
			coarse_id: 38
			coarse_id: 52
			coarse_id: 65
			coarse_id: 71
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 12
			coarse_id: 13
			coarse_id: 33
			coarse_id: 34
			coarse_id: 39
			coarse_id: 62
			coarse_id: 85
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 4
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 33
			coarse_id: 34
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 5
			coarse_id: 13
			coarse_id: 33
			coarse_id: 34
			coarse_id: 62
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 23
			coarse_id: 34
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 5
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 33
			coarse_id: 34
			coarse_id: 62
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 13
			coarse_id: 34
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 8
			coarse_id: 13
			coarse_id: 34
			coarse_id: 38
			coarse_id: 39
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 8
			coarse_id: 13
			coarse_id: 14
			coarse_id: 15
			coarse_id: 31
			coarse_id: 37
		}
		fine2multicoarse_param{
			coarse_id: 8
			coarse_id: 9
			coarse_id: 13
			coarse_id: 14
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 15
			coarse_id: 21
			coarse_id: 35
			coarse_id: 36
		}
		fine2multicoarse_param{
			coarse_id: 8
			coarse_id: 13
			coarse_id: 36
			coarse_id: 37
		}
		fine2multicoarse_param{
			coarse_id: 23
			coarse_id: 24
			coarse_id: 31
			coarse_id: 35
			coarse_id: 36
			coarse_id: 37
			coarse_id: 38
			coarse_id: 39
			coarse_id: 40
			coarse_id: 69
			coarse_id: 82
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 10
			coarse_id: 34
			coarse_id: 35
			coarse_id: 37
			coarse_id: 66
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 6
			coarse_id: 8
			coarse_id: 10
			coarse_id: 11
			coarse_id: 14
			coarse_id: 15
			coarse_id: 16
			coarse_id: 35
			coarse_id: 37
			coarse_id: 64
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 12
			coarse_id: 14
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 24
			coarse_id: 28
			coarse_id: 29
			coarse_id: 30
			coarse_id: 31
			coarse_id: 32
			coarse_id: 35
			coarse_id: 36
			coarse_id: 37
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 24
			coarse_id: 30
			coarse_id: 37
			coarse_id: 38
			coarse_id: 64
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 9
			coarse_id: 15
			coarse_id: 18
			coarse_id: 19
			coarse_id: 24
			coarse_id: 26
			coarse_id: 30
			coarse_id: 31
			coarse_id: 32
			coarse_id: 35
			coarse_id: 37
			coarse_id: 38
			coarse_id: 86
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 10
			coarse_id: 11
			coarse_id: 15
			coarse_id: 59
			coarse_id: 70
			coarse_id: 86
		}
		fine2multicoarse_param{
			coarse_id: 10
			coarse_id: 11
			coarse_id: 39
			coarse_id: 70
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 4
			coarse_id: 7
			coarse_id: 10
			coarse_id: 15
			coarse_id: 33
			coarse_id: 39
			coarse_id: 70
			coarse_id: 83
			coarse_id: 85
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 39
			coarse_id: 74
			coarse_id: 83
			coarse_id: 85
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 33
			coarse_id: 52
			coarse_id: 59
			coarse_id: 62
			coarse_id: 66
			coarse_id: 70
			coarse_id: 74
			coarse_id: 77
			coarse_id: 83
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 15
			coarse_id: 21
			coarse_id: 30
			coarse_id: 33
			coarse_id: 45
			coarse_id: 65
			coarse_id: 70
			coarse_id: 75
			coarse_id: 77
			coarse_id: 83
			coarse_id: 85
			coarse_id: 87
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 45
			coarse_id: 64
			coarse_id: 65
			coarse_id: 83
			coarse_id: 85
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 5
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 33
			coarse_id: 34
			coarse_id: 45
			coarse_id: 61
			coarse_id: 64
			coarse_id: 65
			coarse_id: 66
			coarse_id: 83
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 6
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 39
			coarse_id: 83
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 65
			coarse_id: 83
			coarse_id: 84
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 7
			coarse_id: 10
			coarse_id: 77
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 52
			coarse_id: 77
			coarse_id: 78
			coarse_id: 83
			coarse_id: 84
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 14
			coarse_id: 33
			coarse_id: 37
			coarse_id: 83
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 83
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 10
			coarse_id: 11
			coarse_id: 77
			coarse_id: 78
			coarse_id: 83
			coarse_id: 85
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 11
			coarse_id: 33
			coarse_id: 61
			coarse_id: 67
			coarse_id: 77
			coarse_id: 78
			coarse_id: 83
			coarse_id: 84
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 5
			coarse_id: 6
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 83
			coarse_id: 86
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 64
			coarse_id: 77
			coarse_id: 78
			coarse_id: 83
			coarse_id: 85
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 3
			coarse_id: 6
			coarse_id: 7
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 42
			coarse_id: 45
			coarse_id: 65
			coarse_id: 70
			coarse_id: 75
			coarse_id: 83
			coarse_id: 84
			coarse_id: 85
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 6
			coarse_id: 7
			coarse_id: 8
			coarse_id: 10
			coarse_id: 11
			coarse_id: 33
			coarse_id: 35
			coarse_id: 65
			coarse_id: 75
			coarse_id: 83
			coarse_id: 88
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 4
			coarse_id: 8
			coarse_id: 13
			coarse_id: 14
			coarse_id: 22
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 2
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 1
			coarse_id: 8
			coarse_id: 12
			coarse_id: 14
			coarse_id: 36
			coarse_id: 39
		}
		fine2multicoarse_param{
			coarse_id: 8
			coarse_id: 13
			coarse_id: 39
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 5
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 8
			coarse_id: 12
			coarse_id: 14
			coarse_id: 38
			coarse_id: 52
			coarse_id: 71
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 6
			coarse_id: 8
			coarse_id: 9
			coarse_id: 12
			coarse_id: 14
			coarse_id: 34
			coarse_id: 37
			coarse_id: 38
			coarse_id: 78
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 30
			coarse_id: 36
			coarse_id: 39
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 4
			coarse_id: 6
			coarse_id: 8
			coarse_id: 12
			coarse_id: 14
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 39
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 35
			coarse_id: 37
			coarse_id: 38
			coarse_id: 71
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 8
			coarse_id: 9
			coarse_id: 12
			coarse_id: 14
			coarse_id: 30
			coarse_id: 31
			coarse_id: 36
			coarse_id: 64
		}
		fine2multicoarse_param{
			coarse_id: 8
			coarse_id: 12
			coarse_id: 14
		}
		fine2multicoarse_param{
			coarse_id: 4
			coarse_id: 8
			coarse_id: 12
			coarse_id: 14
			coarse_id: 71
		}
		fine2multicoarse_param{
			coarse_id: 1
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
		}
		fine2multicoarse_param{
			coarse_id: 6
			coarse_id: 8
			coarse_id: 12
			coarse_id: 14
			coarse_id: 36
			coarse_id: 37
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 8
			coarse_id: 12
			coarse_id: 13
			coarse_id: 14
			coarse_id: 15
			coarse_id: 23
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 7
			coarse_id: 8
			coarse_id: 9
			coarse_id: 13
			coarse_id: 14
			coarse_id: 15
			coarse_id: 39
			coarse_id: 55
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 8
			coarse_id: 10
			coarse_id: 14
			coarse_id: 15
			coarse_id: 31
			coarse_id: 86
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 2
			coarse_id: 8
			coarse_id: 13
			coarse_id: 14
			coarse_id: 15
			coarse_id: 49
			coarse_id: 71
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 6
			coarse_id: 8
			coarse_id: 10
			coarse_id: 14
			coarse_id: 15
			coarse_id: 37
			coarse_id: 55
			coarse_id: 65
			coarse_id: 71
			coarse_id: 86
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 8
			coarse_id: 14
			coarse_id: 15
			coarse_id: 37
			coarse_id: 52
			coarse_id: 55
			coarse_id: 65
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 10
			coarse_id: 15
			coarse_id: 33
			coarse_id: 35
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 0
			coarse_id: 3
			coarse_id: 4
			coarse_id: 6
			coarse_id: 8
			coarse_id: 9
			coarse_id: 10
			coarse_id: 13
			coarse_id: 15
			coarse_id: 18
			coarse_id: 24
			coarse_id: 31
			coarse_id: 35
			coarse_id: 37
			coarse_id: 38
			coarse_id: 55
			coarse_id: 65
			coarse_id: 86
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 22
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 28
			coarse_id: 29
			coarse_id: 30
			coarse_id: 31
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
		}
		fine2multicoarse_param{
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 28
			coarse_id: 70
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 28
			coarse_id: 29
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 29
		}
		fine2multicoarse_param{
			coarse_id: 17
			coarse_id: 18
			coarse_id: 20
			coarse_id: 22
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 32
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 18
			coarse_id: 19
			coarse_id: 22
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 28
			coarse_id: 29
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 27
			coarse_id: 29
			coarse_id: 30
			coarse_id: 38
			coarse_id: 71
			coarse_id: 78
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 24
			coarse_id: 27
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 13
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 27
			coarse_id: 29
			coarse_id: 38
			coarse_id: 70
			coarse_id: 84
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 29
			coarse_id: 34
			coarse_id: 78
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 22
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 29
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 27
			coarse_id: 29
			coarse_id: 30
			coarse_id: 42
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 29
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 23
			coarse_id: 24
			coarse_id: 26
			coarse_id: 27
			coarse_id: 52
			coarse_id: 77
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 29
			coarse_id: 31
			coarse_id: 38
			coarse_id: 52
			coarse_id: 69
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 22
			coarse_id: 24
			coarse_id: 29
			coarse_id: 30
			coarse_id: 35
			coarse_id: 69
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 28
			coarse_id: 29
			coarse_id: 30
			coarse_id: 31
			coarse_id: 34
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 28
			coarse_id: 29
			coarse_id: 30
			coarse_id: 31
			coarse_id: 35
			coarse_id: 69
		}
		fine2multicoarse_param{
			coarse_id: 2
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 20
			coarse_id: 23
			coarse_id: 24
			coarse_id: 27
			coarse_id: 40
			coarse_id: 83
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 27
			coarse_id: 28
			coarse_id: 29
			coarse_id: 30
			coarse_id: 31
			coarse_id: 36
			coarse_id: 56
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 20
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 29
			coarse_id: 30
			coarse_id: 34
		}
		fine2multicoarse_param{
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 28
			coarse_id: 29
			coarse_id: 30
			coarse_id: 31
			coarse_id: 37
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 26
			coarse_id: 27
			coarse_id: 29
			coarse_id: 37
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 28
			coarse_id: 29
			coarse_id: 30
			coarse_id: 31
			coarse_id: 36
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 26
			coarse_id: 27
			coarse_id: 36
			coarse_id: 60
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 20
			coarse_id: 21
			coarse_id: 23
			coarse_id: 24
			coarse_id: 31
			coarse_id: 35
			coarse_id: 60
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 27
			coarse_id: 29
			coarse_id: 35
			coarse_id: 37
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 31
			coarse_id: 32
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 26
			coarse_id: 28
			coarse_id: 30
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 22
			coarse_id: 24
			coarse_id: 31
			coarse_id: 37
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 26
			coarse_id: 70
			coarse_id: 86
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 29
			coarse_id: 30
			coarse_id: 52
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 26
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 29
			coarse_id: 78
		}
		fine2multicoarse_param{
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
		}
		fine2multicoarse_param{
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 29
			coarse_id: 64
		}
		fine2multicoarse_param{
			coarse_id: 15
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 30
			coarse_id: 31
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 26
			coarse_id: 28
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 27
			coarse_id: 52
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 26
			coarse_id: 29
			coarse_id: 35
			coarse_id: 38
			coarse_id: 84
		}
		fine2multicoarse_param{
			coarse_id: 14
			coarse_id: 16
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 22
			coarse_id: 24
			coarse_id: 30
		}
		fine2multicoarse_param{
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 26
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 29
		}
		fine2multicoarse_param{
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 26
			coarse_id: 28
			coarse_id: 29
		}
		fine2multicoarse_param{
			coarse_id: 15
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 26
			coarse_id: 35
			coarse_id: 86
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 26
		}
		fine2multicoarse_param{
			coarse_id: 10
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 26
			coarse_id: 29
			coarse_id: 33
			coarse_id: 82
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 29
		}
		fine2multicoarse_param{
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 26
		}
		fine2multicoarse_param{
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 26
			coarse_id: 28
			coarse_id: 31
			coarse_id: 54
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 26
			coarse_id: 28
			coarse_id: 29
			coarse_id: 38
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 29
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 18
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 27
			coarse_id: 29
			coarse_id: 38
			coarse_id: 69
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 18
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 27
			coarse_id: 30
			coarse_id: 35
			coarse_id: 37
			coarse_id: 38
			coarse_id: 70
			coarse_id: 84
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 28
			coarse_id: 29
			coarse_id: 30
			coarse_id: 37
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 28
			coarse_id: 29
			coarse_id: 37
			coarse_id: 38
			coarse_id: 70
		}
		fine2multicoarse_param{
			coarse_id: 8
			coarse_id: 9
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 28
			coarse_id: 30
			coarse_id: 32
			coarse_id: 35
			coarse_id: 36
			coarse_id: 37
			coarse_id: 38
			coarse_id: 58
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 27
			coarse_id: 31
			coarse_id: 35
			coarse_id: 38
			coarse_id: 70
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 22
			coarse_id: 24
			coarse_id: 87
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 28
			coarse_id: 29
			coarse_id: 31
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 29
			coarse_id: 83
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 26
			coarse_id: 27
			coarse_id: 29
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
			coarse_id: 18
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 25
			coarse_id: 29
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 18
			coarse_id: 19
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 24
			coarse_id: 25
			coarse_id: 28
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 15
			coarse_id: 17
			coarse_id: 18
			coarse_id: 20
			coarse_id: 21
			coarse_id: 22
			coarse_id: 23
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 29
			coarse_id: 61
		}
		fine2multicoarse_param{
			coarse_id: 9
			coarse_id: 17
			coarse_id: 18
			coarse_id: 20
			coarse_id: 22
			coarse_id: 24
			coarse_id: 25
			coarse_id: 27
			coarse_id: 29
		}
		fine2multicoarse_param{
			coarse_id: 16
			coarse_id: 17
